INSERT INTO movies (name, description, duration)
VALUES ('Терминатор', 'О терминаторе', 7200),
       ('Крепкий орешек', 'О крепком орешке', 7200),
       ('Елки', 'О елках', 7200);

INSERT INTO halls (room_number)
VALUES (1),
       (2);

INSERT INTO places (row, place, hall_id)
VALUES (1, 1, 1),
       (1, 2, 1),
       (2, 1, 1),
       (2, 2, 1),
       (1, 1, 2),
       (1, 2, 2),
       (2, 1, 2),
       (2, 2, 2);

INSERT INTO sessions (session_time, movie_id, hall_id)
VALUES ('2025-01-17T12:14:17+00:00', 1, 1),
       ('2025-01-18T12:14:17+00:00', 1, 2),
       ('2025-01-19T12:14:17+00:00', 2, 1),
       ('2025-01-20T12:14:17+00:00', 3, 1);

INSERT INTO prices (price, session_id, place_id)
VALUES (25.00, 1, 1),
       (25.00, 1, 2),
       (20.00, 1, 3),
       (20.00, 1, 4),
       (25.00, 2, 5),
       (25.00, 2, 6),
       (20.00, 2, 7),
       (20.00, 2, 8),
       (15.00, 3, 1),
       (15.00, 3, 2),
       (10.00, 3, 3),
       (10.00, 3, 4),
       (7.00, 4, 1),
       (7.00, 4, 2),
       (4.00, 4, 3),
       (4.00, 4, 4);

INSERT INTO users (name)
VALUES ('Денис'),
       ('Катя'),
       ('Филипп'),
       ('Ксения');

INSERT INTO tickets (price_id, user_id, price)
VALUES (1, 1, 25.00),
       (4, 4, 20.00),
       (5, 1, 25.00),
       (6, 2, 25.00),
       (7, 3, 20.00),
       (8, 4, 20.00),
       (9, 3, 15.00),
       (10, 2, 15.00),
       (11, 4, 10.00),
       (12, 1, 10.00),
       (13, 1, 7.00),
       (14, 4, 7.00),
       (15, 3, 4.00),
       (16, 2, 4.00);
