INSERT INTO halls (id, name)
VALUES (1, 'Зал Чаплин'),
       (2, 'Зал Гайдай'),
       (3, 'Зал Люмьер');

INSERT INTO films (id, name, duration)
VALUES (1, 'Пираты галактики', 100),
       (2, 'Гиганты Ла-Манша', 90),
       (3, 'Дэдпул и Росомаха', 130);

INSERT INTO sessions_films (id, film_id, hall_id, date_start)
VALUES (1, 1, 1, '2024-08-27 10:00:00'),
       (2, 1, 2, '2024-08-27 12:00:00'),
       (3, 2, 2, '2024-08-27 16:00:00'),
       (4, 3, 3, '2024-08-27 22:00:00');

INSERT INTO hall_seats (id, hall_id, row, col)
VALUES (1, 1, 1, 1),
       (2, 1, 1, 2),
       (3, 1, 1, 3),
       (4, 1, 2, 1),
       (5, 1, 2, 2),
       (6, 1, 2, 3),

       (11, 2, 1, 1),
       (12, 2, 1, 2),
       (13, 2, 1, 3),
       (14, 2, 2, 1),
       (15, 2, 2, 2),
       (16, 2, 2, 2),

       (21, 3, 1, 1),
       (22, 3, 1, 2),
       (23, 3, 1, 3),
       (24, 3, 2, 1),
       (25, 3, 2, 2),
       (26, 3, 2, 3),;

INSERT INTO users (id, name)
VALUES (1, 'Петя'),
       (2, 'Вася'),
       (3, 'Маша');

INSERT INTO prices (id, seat_id, session_id, price)
VALUES (1, 1, 2, 100),
       (2, 2, 3, 100),
       (3, 3, 2, 200),
       (4, 4, 2, 200),
       (5, 5, 2, 100),
       (6, 6, 2, 100),

       (7, 11, 4, 100),
       (8, 12, 2, 100),
       (9, 13, 2, 100),
       (10, 14, 2, 100),
       (11, 15, 2, 100);

INSERT INTO tickets (id, price_id, user_id)
VALUES (1, 1, 1),
       (2, 2, 1),
       (3, 3, 2),
       (4, 3, 3);
