INSERT INTO eav.movies(id, title) VALUES
    (1, 'За пригоршню долларов'),
    (2, 'Семь самураев'),
    (3, '2001: Космическая одиссея'),
    (4, 'Крестный отец'),
    (5, 'Терминатор');

INSERT INTO eav.attribute_types(id, name, value_type) VALUES
    (1, 'Рецензия', 'text'),
    (2, 'Премия', 'boolean'),
    (3, 'Важная дата', 'date'),
    (4, 'Служебная дата', 'date');

INSERT INTO eav.attributes(id, name, attribute_type_id) VALUES
    (1, 'Рецензия критика', 1),
    (2, 'Отзыв киноакадемии', 1),
    (3, 'Оскар', 2),
    (4, 'Ника', 2),
    (5, 'Мировая премьера', 3),
    (6, 'Премьера в РФ', 3),
    (7, 'Начло продажи билетов', 4),
    (8, 'Запуск рекламы', 4);

INSERT INTO eav.values (movie_id, attribute_id, text_value) VALUES
    (1, 1, 'Хороший фильм'),
    (2, 1, 'Прекрасный фильм'),
    (3, 1, 'Замечательный фильм'),
    (4, 2, 'Отличный фильм'),
    (5, 2, 'Великолепный фильм');

INSERT INTO eav.values (movie_id, attribute_id, boolean_value) VALUES
    (1, 3, TRUE),
    (2, 3, TRUE),
    (3, 3, TRUE),
    (4, 4, TRUE),
    (5, 4, TRUE),
    (5, 3, FALSE);

INSERT INTO eav.values (movie_id, attribute_id, date_value) VALUES
    (1, 5, '2024-04-10'),
    (2, 5, '2024-04-11'),
    (3, 5, '2024-04-25'),
    (4, 5, '2024-04-27'),
    (5, 5, '2024-05-30'),
    (1, 6, '2024-04-15'),
    (2, 6, '2024-04-16'),
    (3, 6, '2024-04-26'),
    (4, 6, '2024-04-27'),
    (5, 6, '2024-06-30'),
    (1, 7, '2024-05-17'),
    (2, 7, '2024-04-30'),
    (3, 7, '2024-04-27'),
    (4, 7, '2024-04-27'),
    (5, 7, '2024-04-27'),
    (1, 8, '2024-04-27'),
    (2, 8, '2024-05-17'),
    (3, 8, '2024-04-27'),
    (4, 8, '2024-05-30'),
    (5, 8, '2024-05-17');
